/*1952339 信08 张馨月*/
#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <climits>
#include <conio.h>
#include <Windows.h>
//允许添加自己需要的头文件
#include "../include/class_cct.h"
#include "../include/class_gmw_cfi.h"
using namespace std;

/* --------------------------------------------------------------------------
	此处可以给出需要的静态全局变量
		1、尽可能少，最好没有
		2、静态全局只读变量/宏定义个数不限
		3、不允许外部全局变量
   --------------------------------------------------------------------------
*/

/* --------------------------------------------------------------------------
	此处可以给出需要的内部函数的实现
		1、函数名不限，建议为 cfi_inner_*
		2、个数不限
		3、如果是成员函数，必须是在private/protected中声明的函数
		4、如果是全局函数，必须是static，即仅限制在本源程序文件内部使用
   --------------------------------------------------------------------------
*/
int CONSOLE_FRAME_INFO::setcolor(const CCT_COLOR bg_color, const CCT_COLOR fg_color)
{
	if(bg_color != CCT_COLOR::invalid)
		this->bgcolor = bg_color;
	if(fg_color != CCT_COLOR::invalid)
		this->fgcolor = fg_color;
	return 1;
}
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
 ***************************************************************************/

/* --------------------------------------------------------------------------
	 此处可以给出需要的公共函数的实现
		 1、函数名不限，建议为 cfi_*
		 2、个数不限
		 3、如果是成员函数，必须是在public中声明的函数
		 4、不允许外部全局函数
	--------------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
 ***************************************************************************/
